# FabricationSaveJobOptions Constructor (Boolean) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationSaveJobOptions Constructor (Boolean)
FabricationSaveJobOptions Class See Also
---
Constructor
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public FabricationSaveJobOptions(
	bool addHolesForTaps
)
```

Visual Basic
---
```text
Public Sub New ( _
	addHolesForTaps As Boolean _
)
```

Visual C++
---
```text
public:
FabricationSaveJobOptions(
	bool addHolesForTaps
)
```

# ### Parameters
addHolesForTaps
    Type: System..::..Boolean Set true to have holes for taps on straights added to the created fabrication job.
# See Also
FabricationSaveJobOptions Class
FabricationSaveJobOptions Overload
Autodesk.Revit.DB.Fabrication Namespace